# Задание на лабу
# Номера НЗБП в СВИ-1 (𝑝) с указанием цветовых каналов:
# Blue-4 XOR Green-1
# Цветовой канал, используемый в СВИ-4:
# Cb
#





def print_hi(name):
    # Use a breakpoint in the code line below to debug your script.
    print(f'Hi, {name}')  # Press Ctrl+F8 to toggle the breakpoint.


# Press the green button in the gutter to run the script.
if __name__ == '__main__':
    print_hi('PyCharm')

# See PyCharm help at https://www.jetbrains.com/help/pycharm/
