# Задание на лабу
# Номера НЗБП в СВИ-1 (𝑝) с указанием цветовых каналов:
# Blue-4 XOR Green-1
# Цветовой канал, используемый в СВИ-4:
# Cb
#


if __name__ == "__main__":
    print("start")